run/case_SA/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-14;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-14;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        
        type            fixedValue;
        value           uniform 1e-14;
    }

    bottom
    {
        
        type            fixedValue;
        value           uniform 1e-14;
    }

    wing
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
